from collections import namedtuple

gua2num = {
	# 阳爻为1，阴爻为0，最高位为上爻
	# 以下乾宫八卦，俱属金
	"乾": 0b111111,		
	"姤": 0b111110,
	"遁": 0b111100,
	"否": 0b111000,
	"观": 0b110000,
	"剥": 0b100000,
	"晋": 0b101000,
	"大有": 0b101111,

	# 以下震宫八卦，具属木
	"震": 0b001001,
	"豫": 0b001000,
	"解": 0b001010,
	"恒": 0b001110,
	"升": 0b000110,
	"井": 0b010110,
	"大过": 0b011110,
	"随": 0b011001,

	# 以下坎宫八卦，具属水
	"坎": 0b010010,
	"节": 0b010011,
	"屯": 0b010001,
	"既济": 0b010101,
	"革": 0b011101,
	"丰": 0b001101,
	"明夷": 0b000101,
	"师":0b000010,

	# 以下艮宫八卦，具属土
	"艮": 0b100100,
	"贲": 0b100101,
	"大畜": 0b100111,
	"损": 0b100011,
	"睽": 0b101011,
	"履": 0b111011,
	"中孚": 0b110011,
	"渐": 0b110100,

	# 以下坤宫八卦，具属土
	"坤": 0b000000,
	"复": 0b000001,
	"临": 0b000011,
	"泰": 0b000111,
	"大壮": 0b001111,
	"夬": 0b011111,
	"需": 0b010111,
	"比": 0b010000,

	# 以下巽宫八卦，具属木
	"巽": 0b110110,
	"小畜": 0b110111,
	"家人": 0b110101,
	"益": 0b110001,
	"无妄": 0b111001,
	"噬嗑": 0b101001,
	"颐": 0b100001,
	"蛊": 0b100110,

	# 以下离宫八卦，具属火
	"离": 0b101101,
	"旅": 0b101100,
	"鼎": 0b101110,
	"未济": 0b101010,
	"蒙": 0b100010,
	"涣": 0b110010,
	"讼": 0b111010,
	"同人": 0b111101,

	# 以下兑宫八卦，具属金
	"兑": 0b011011,
	"困": 0b011010,
	"萃": 0b011000,
	"咸": 0b011100,
	"蹇": 0b010100,
	"谦": 0b000100,
	"小过": 0b001100,
	"归妹": 0b001011,
}

# 数字到六十四卦的映射
num2gua = {num:gua for gua,num in gua2num.items()}

# 八宫卦表
gong_gua = [gua for gua in gua2num if (gua2num[gua] >> 3) == (gua2num[gua] & 0b000111)]

# 宫之五行
gong2wuxing = {
	"乾": "金",
	"坎": "水",
	"艮": "土",
	"震": "木",
	"巽": "木",
	"离": "火",
	"坤": "土",
	"兑": "金",
}

# 八卦之象
gong2xiang = {
	"乾": "天",
	"坎": "水",
	"艮": "山",
	"震": "雷",
	"巽": "风",
	"离": "火",
	"坤": "地",
	"兑": "泽",
}

# 八宫納甲
gong2gan = {
	"乾内": "甲",
	"乾外": "壬",
	"坎": "戊",
	"艮": "丙",
	"震": "庚",
	"巽": "辛",
	"离": "己",
	"坤内": "乙",
	"坤外": "癸",
	"兑": "丁",	
}
gong2zhi = {
	"乾": ("子", "寅", "辰", "午", "申", "戌"),
	"坎": ("寅", "辰", "午", "申", "戌", "子"),
	"艮": ("辰", "午", "申", "戌", "子", "寅"),
	"震": ("子", "寅", "辰", "午", "申", "戌"),
	"巽": ("丑", "亥", "酉", "未", "巳", "卯"),
	"离": ("卯", "丑", "亥", "酉", "未", "巳"),
	"坤": ("未", "巳", "卯", "丑", "亥", "酉"),
	"兑": ("巳", "卯", "丑", "亥", "酉", "未"),
}

#宫、世表
num2shigong = {
	0: "上世",
	1: "一世",
	3: "二世",
	7: "三世",
	15: "四世",
	31: "五世",
	23: "游魂",
	16: "归魂",
}

shigong2shiyao = {
	"上世": 5,
	"一世": 0,
	"二世": 1,
	"三世": 2,
	"四世": 3,
	"五世": 4,
	"游魂": 3,
	"归魂": 2,
}

# 天干五行
gan2wuxing = {
	"甲": "木",
	"乙": "木",
	"丙": "火",
	"丁": "火",
	"戊": "土",
	"己": "土",
	"庚": "金",
	"辛": "金",
	"壬": "水",
	"癸": "木",
}

# 地支五行
zhi2wuxing = {
	"寅": "木",
	"卯": "木",
	"辰": "土",
	"巳": "火",
	"午": "火",
	"未": "土",
	"申": "金",
	"酉": "金",
	"戌": "土",
	"亥": "水",
	"子": "水",
	"丑": "土",
}

# 八卦之数
gong2num = {gong: num & 0b000111 for gong, num in gua2num.items() if gong in gong_gua}

num2gong = {num: gong for gong, num in gong2num.items()}

# 五行相生
wuxing_sheng = {
	"金": "水",
	"水": "木",
	"木": "火",
	"火": "土",
	"土": "金",
}

# 五行生我者
wuxing_shengwo = {sheng:xing for xing,sheng in wuxing_sheng.items()}

# 五行相克
wuxing_ke = {
	"金": "木",
	"木": "土",
	"土": "水",
	"水": "火",
	"火": "金",
}

# 五行克我者
wuxing_kewo = {ke:xing for xing,ke in wuxing_ke.items()}

# 六十甲子
jiazi = (
	"甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉",
	"甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未",
	"甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳",
	"甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅", "癸卯",
	"甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑",
	"甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥",
)

# 六兽
liushou = (
	"青龙",
	"朱雀",
	"勾陈",
	"螣蛇",
	"白虎",
	"玄武",
)

# 阴历日期
LunarDate = namedtuple("LunarDate", "year, month, day")